### Exercise 1

In [31]:
import pandas as pd

url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipo = pd.read_csv(url, sep ='\t')

# print(chipo.head(10))

# print(f'Total entries :', chipo.shape[0])

# print(f'Total number of columns:',chipo.shape[1])

# print(f'columns name:', chipo.columns)

# print('Index information : ',chipo.index)

# val = chipo['item_name'].value_counts().idxmax()
# print(val)

# quan = chipo['quantity'].sum()
# print(' total number of items ordered: ', quan)

# val_choice = chipo['choice_description'].value_counts().idxmax()
# print(val_choice)

# convert = chipo['item_price'].apply(lambda x: float(x[1:]))

# sums = convert.sum()
# print('total revenue :',sums)

# solo = chipo['order_id'].nunique()
# print('total number of orders :', solo)

# avg = sums / quan
# print('Average : ',avg)

# nun = chipo['item_name'].nunique()
# print("Unique :", nun)

Unique : 50

### Exercise 2

In [33]:
# moneyMore = chipo[convert > 10]
# count = moneyMore.shape[0]
# print(count)

1130

### Exercise 3

In [35]:
user_url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users =pd.read_csv(user_url, sep='|')

mean_age = users.groupby('occupation')['age'].mean()
print('Mean age by occupation: \n',mean_age)

Mean age by occupation:
 occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Exercise 4

In [42]:
data1 =pd.DataFrame({ 
    'subject_id': [1,2,3],
    'sub_name':['Maths','English','French']
})
data2 =pd.DataFrame({ 
    'subject_id': [4,5,6],
    'sub_name':['Accounts','Business','Computer']
})
data3 =pd.DataFrame({ 
    'subject_id': [7,8,9],
    'sub_name':['Marine','Biology','Literature']
})

Merge = pd.concat([data1,data2])
print(Merge)

Merge_col = pd.concat([data1,data2], axis=1)
print(Merge_col)

   subject_id  sub_name
0           1     Maths
1           2   English
2           3    French
0           4  Accounts
1           5  Business
2           6  Computer
   subject_id sub_name  subject_id  sub_name
0           1    Maths           4  Accounts
1           2  English           5  Business
2           3   French           6  Computer

### Exercise 5

In [45]:
Iris_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
column_names =['sepal_length', 'sepal_width', 'petal_length', 'petal_width','species']
iris= pd.read_csv(Iris_url,names=column_names)

missing = iris.isnull().sum()
print(missing)

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

### Exercise 6

In [46]:
pokemon_data = {'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
    'hp': [45, 39, 44, 45],
    'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
    'pokedex': ['yes', 'no', 'yes', 'no'],
    'type': ['grass', 'fire', 'water', 'bug']}

pokemon = pd.DataFrame(pokemon_data)
pokemon = pokemon[['name', 'type', 'hp', 'evolution', 'pokedex']]
print(pokemon)

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Exercise 7

In [49]:
baby_name_url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(baby_name_url)

# print(baby_names.head(10))

baby_del = baby_names.drop(columns=['Unnamed: 0','Id'])
print(baby_del)

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Exercise 8

In [57]:
Us_UR = 'https://raw.githubusercontent.com/datasets/investor-flow-of-funds-us/master/data/weekly.csv'
investor = pd.read_csv(Us_UR)

frequency = pd.infer_freq(investor)
print(frequency)

Date= investor.set_index('Date')
print(Date)

None
            Total Equity  Domestic Equity  World Equity  Hybrid  Total Bond  \
Date
2012-12-05         -7426            -6060         -1367     -74        5317
2012-12-12         -8783            -7520         -1263     123        1818
2012-12-19         -5496            -5470           -26     -73         103
2012-12-26         -4451            -4076          -375     550        2610
2013-01-02        -11156            -9622         -1533    -158        2383
2013-01-09         14817             7995          6821    2888        9766
2014-04-02          3155              938          2217     265        3379
2014-04-09          5761             2080          3681    1482        1609
2014-04-16          2286              634          1652    1186         633
2014-04-23          3530             1392          2138    1239        1984
2014-04-30         -3890            -3996           106     759         888
2014-05-07           632            -2006          2639    -340        5493
2014-05-14         -1079            -2321          1242    1188        4037
2014-05-21           697            -1790          2487    1216        2196
2014-05-28         -2453            -2603           150    1108        2041
2014-06-04          2098            -1148          3246    1123         188
2014-06-11          1236            -1840          3075    1159        2112
2014-06-18          -922            -2204          1282    1060        4159
2014-06-25           -93            -1354          1262    1246        3256
2014-07-02         -7835            -8887          1052     636        2979
2014-07-09           666            -1070          1736    1006        2721
2014-07-30           118            -1171          1290    1024        1806
2014-08-06          -471            -3073          2602    -375       -8193
2014-08-13           320             -974          1294     496        1436
2014-08-20          2671              738          1933     821        4999
2014-08-27          -577            -2199          1623     943        3655
2014-09-03         -4024            -5305          1281     544        2430
2014-09-10          1257            -1291          2548    1055        1554
2014-11-05           -32            -1634          1602    -176        5813
2014-11-12          1464               61          1403     963        3596
2014-11-19         -3010            -3622           611      99        2529
2014-11-25         -1175            -2044           869    -157        2590
2015-01-07         -3913            -5438          1525   -1057       -3403
2015-01-14          1774              -37          1811     248        3549
2015-01-21          1267              856           411     790        1258
2015-01-28          4343             3455           888    1748        5964
2015-02-04          4240             3536           703     793        3237
2015-02-11          1268              -27          1296     959        5862
2015-03-04           999            -1933          2932     528        4984
2015-03-11          3911               -7          3918     851        1298
2015-03-18          1948            -1758          3706     912         452
2015-03-25         -1167            -4478          3311     538        2404
2015-04-01         -1527            -3307          1780     720       -1296
2015-04-08          1906            -1321          3227     250        1719

            Taxable Bond  Municipal Bond  Total
Date
2012-12-05          4210            1107  -2183
2012-12-12          1598             219  -6842
2012-12-19          3472           -3369  -5466
2012-12-26          3333            -722  -1291
2013-01-02          2103             280  -8931
2013-01-09          7311            2455  27471
2014-04-02          3129             250   6799
2014-04-09          1448             161   8852
2014-04-16           604              29   4105
2014-04-23          1453             531   6753
2014-04-30           559             329  -2242
2014-05-07          4417            1076   5785
2014-05-14          3141             897   4146
2014-05-21          1398             798   4109
2014-05-28          1236             805    696
2014-06-04          -470             658   3409
2014-06-11          1587             524   4506
2014-06-18          3740             419   4297
2014-06-25          2694             562   4409
2014-07-02          2704             276  -4220
2014-07-09          3203            -482   4393
2014-07-30          1119             687   2949
2014-08-06         -8658             465  -9040
2014-08-13           539             897   2252
2014-08-20          4185             814   8490
2014-08-27          2921             734   4021
2014-09-03          1768             661  -1050
2014-09-10           711             843   3866
2014-11-05          5284             529   5604
2014-11-12          2703             893   6023
2014-11-19          1758             771   -383
2014-11-25          1821             769   1258
2015-01-07         -4729            1326  -8373
2015-01-14          2582             967   5572
2015-01-21           220            1038   3315
2015-01-28          4689            1275  12055
2015-02-04          2274             963   8270
2015-02-11          5169             693   8089
2015-03-04          4309             675   6511
2015-03-11           999             298   6059
2015-03-18           258             194   3312
2015-03-25          1701             703   1775
2015-04-01         -1392              96  -2103
2015-04-08          1906            -187   3875